---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralS
source: html/18470381-141e-79c3-4e0f-ae3b21882d8a.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralS

Defines parameters for Round Bar structural section.

## Syntax (C#)
```csharp
public class StructuralSectionGeneralS : StructuralSectionRound
```